In [126]:
import importlib
import subprocess

import Advanced_SQL as asql
import duckdb
import SQL as sql

_ = importlib.reload(asql)
_ = importlib.reload(sql)

Use this cell to test any sql queries. This can be done in one of the following ways:

1. Fill in the `qry` within the """ """.
2. Call the question functions that you have already filled in from the SQL.py and Advanced_SQL.py files. An example of question_1 being called from the SQL.py file is currently commented out.

This cell can be copied if you wish to run multiple queries.

In [127]:
qry = """  
SELECT * FROM customers
"""

# qry = sql.question_1()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

      CustomerID      Name    Surname  Age  Gender  Income       Region
0              1    prince      linda   24  Female   89097           GT
1              2    shneur       axel   34  Female   62719           EC
2              3  michelle      anisa   48  Female   45999  EasternCape
3              4       eli        zoe   34  Female   48926           NC
4              5       max   virginia   67  Female   80778           MP
...          ...       ...        ...  ...     ...     ...          ...
1009         996    tianna  elizabeth   39  Female   81930           WC
1010         997    mariah     januel   65  Female   45704           MP
1011         998      liam     prince   52  Female   84203           MP
1012         999   crystal       luna   71  Female   52113           LP
1013        1000  nicholas      rylee   51    Male   84711           LP

[1014 rows x 7 columns]

Should you break/incorrectly update any database tables, the database can be reset by running the following cell

In [128]:
load_script_path = "database/database_load.py"
subprocess.run(["python3", load_script_path])

CompletedProcess(args=['python3', 'database/database_load.py'], returncode=0)

In [129]:
#Question 1
qry = sql.question_1()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

        Name   Surname  CustomerID
0    grayson     aziza           9
1    grayson     aziza           9
2       aria     malek          14
3       aria     malek          14
4      henry     noemi          98
5      henry     noemi          98
6      alina    carter         160
7      alina    carter         160
8   scarlett     naomi         176
9   scarlett     naomi         176
10  gabriela     jesse         281
11  gabriela     jesse         281
12   juliana    hunter         304
13   juliana    hunter         304
14     chavy   rebecca         370
15     chavy   rebecca         370
16    nelson     rehan         501
17    nelson     rehan         501
18    eileen  augustus         630
19    eileen  augustus         630
20    wesley    shimon         687
21    wesley    shimon         687
22     aayan     devin         888
23     aayan     devin         888
24    alexis     amira         957
25    alexis     amira         957
26   crystal      luna         999
27   crystal      luna         999

In [130]:
#Question 2
qry = sql.question_2()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

        Name   Surname  Income
0      caden     eshal   89820
1      sadie  victoria   89647
2     amelia  theodore   89641
3     samuel    hailey   89623
4     sydney    alyssa   89603
..       ...       ...     ...
483   stella      noel   40999
484    amber    yadiel   40771
485   matias    reuben   40529
486  eliezer   richard   40513
487  cynthia     faith   40116

[488 rows x 3 columns]

In [131]:
#Question 3
qry = sql.question_3()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

   LoanTerm  TotalLoans  ApprovedLoans  ApprovedPercentage
0        12         199           96.0               48.24
1        24         204           97.0               47.55
2        36         186           85.0               45.70
3        48         221          118.0               53.39
4        60         204           95.0               46.57

In [132]:
qry = sql.question_4()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

  CustomerClass  Count
0             B    521
1             A    487
2            A+      6

In [133]:
# Question 5
qry = sql.question_5()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

  CustomerClass  Count
0             A    487
1             C    275
2             B    246
3            A+      6

In [134]:
# AS: Question 1:
qry = asql.question_1()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

  CustomerClass  AverageIncome
0             A   64263.165669
1            A+   76921.000000
2             B   65068.658730
3             C   64570.985866

In [135]:
# AS: Question 2:
qry = asql.question_2()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

        Province  RejectedApplications
0    EasternCape                    68
1      FreeState                    51
2        Gauteng                    65
3  KwaZulu-Natal                    51
4        Limpopo                    61
5     Mpumalanga                    67
6      NorthWest                    50
7   NorthernCape                    62
8    WesternCape                    58

In [136]:
# AS: Question 3:
qry = asql.question_3()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

,CustomerID,Income,LoanAmount,LoanTerm,InterestRate,ApprovalStatus,CreditScore
0,1,89097.0,10077.0,48,4.88,Rejected,683
1,2,62719.0,22944.0,36,4.58,Rejected,729
2,3,45999.0,27501.0,48,7.89,Approved,756
3,4,48926.0,15511.0,48,6.22,Rejected,669
4,5,80778.0,15090.0,24,4.39,Approved,659
...,...,...,...,...,...,...,...
1093,545,75507.0,15999.0,36,8.27,Rejected,793
1094,677,51914.0,14426.0,24,4.98,Approved,656
1095,875,73459.0,28091.0,12,5.55,Rejected,652
1096,981,52830.0,12009.0,36,5.50,Rejected,704
1097,993,72236.0,14592.0,36,6.19,Approved,795

In [137]:
# AS: Question 4:
qry = asql.question_4()


with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

       CustomerID  MonthName  NumberOfRepayments  AmountTotal
0               1    January                   0          0.0
1               1   February                   1        364.0
2               1      March                   0          0.0
3               1      April                   0          0.0
4               1        May                   0          0.0
...           ...        ...                 ...          ...
12163        1000     August                   0          0.0
12164        1000  September                   0          0.0
12165        1000    October                   0          0.0
12166        1000   November                   0          0.0
12167        1000   December                   0          0.0

[12168 rows x 4 columns]

In [138]:
# AS: Question 5:
qry = asql.question_5()

with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

,CustomerID,January_Repayments,January_Total,February_Repayments,February_Total,March_Repayments,March_Total,April_Repayments,April_Total,May_Repayments,...,August_Repayments,August_Total,September_Repayments,September_Total,October_Repayments,October_Total,November_Repayments,November_Total,December_Repayments,December_Total
0,1,0,0.0,1,364.0,0,0.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,0,0.0
1,2,1,359.0,0,0.0,1,352.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,0,0.0
2,3,1,164.0,1,60.0,1,154.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,2,392.0
3,4,1,405.0,0,0.0,0,0.0,1,463.0,0,...,0,0.0,1,123.0,1,315.0,0,0.0,0,0.0
4,5,0,0.0,0,0.0,0,0.0,1,468.0,0,...,1,269.0,0,0.0,0,0.0,0,0.0,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,0,0.0,0,0.0,0,0.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,1,400.0,0,0.0
996,997,0,0.0,0,0.0,0,0.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,0,0.0
997,998,1,479.0,0,0.0,0,0.0,0,0.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,0,0.0
998,999,0,0.0,0,0.0,0,0.0,0,0.0,0,...,0,0.0,2,190.0,0,0.0,0,0.0,0,0.0
999,1000,1,301.0,0,0.0,0,0.0,1,390.0,0,...,0,0.0,0,0.0,0,0.0,0,0.0,0,0.0

In [139]:
qry = asql.question_6()

with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

      CustomerID  Age  CorrectedAge  Gender
0              1   24            48  Female
1              2   34            34  Female
2              3   48            67  Female
3              4   34            59  Female
4              5   67            18  Female
...          ...  ...           ...     ...
1009         990   34            44    Male
1010         991   66            39    Male
1011         993   44            51    Male
1012         994   39            21    Male
1013        1000   51            64    Male

[1014 rows x 4 columns]

In [125]:
qry = asql.question_7()

with duckdb.connect("database/loan.db") as cursor:
    result_set = cursor.execute(qry).df()

result_set

      CustomerID  Age  CorrectedAge  Gender  AgeCategory  Rank
0              1   24            48  Female        Adult    62
1              2   34            34  Female        Adult   196
2              4   34            59  Female        Adult   155
3              6   59            36  Female        Adult   174
4             13   18            36  Female        Adult   190
...          ...  ...           ...     ...          ...   ...
1009         962   61            20    Male  Young Adult   116
1010         968   49            23    Male  Young Adult    57
1011         970   35            29    Male  Young Adult     6
1012         983   46            23    Male  Young Adult   125
1013         994   39            21    Male  Young Adult    79

[1014 rows x 6 columns]